public_html/Theory/programming101.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-06-11 Thu 04:17 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>&lrm;</title>
<meta name="generator" content="Org mode">
<meta name="author" content="John Doe">
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="content">
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd9ac96e">1. Software Solution Design</a>
<ul>
<li><a href="#orga699118">1.1. Analyzing the problem</a>
<ul>
<li><a href="#org2c6b99c">1.1.1. Example</a></li>
</ul>
</li>
<li><a href="#orgaab4903">1.2. But it&rsquo;s not THAT simple&#x2026;</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<div id="outline-container-orgd9ac96e" class="outline-2">
<h2 id="orgd9ac96e"><span class="section-number-2">1</span> Software Solution Design</h2>
<div class="outline-text-2" id="text-1">
<p>
Since the design of a solution resides in the context of creativity and therefore two or more distinct solutions could apply to the same problem we still can notice that they all consist of at least the following two stages:
</p>
<ul class="org-ul">
<li>Analyzing the problem</li>
<li>Programming the solution</li>
</ul>
</div>

<div id="outline-container-orga699118" class="outline-3">
<h3 id="orga699118"><span class="section-number-3">1.1</span> Analyzing the problem</h3>
<div class="outline-text-3" id="text-1-1">
<p>
While it seems pretty complicated to find a good solution to a problem if we let our mind ramble on with uncanny supositions, narrowing the context of it to the machine level it makes the task of coming up with a strategy a much easier endeavor. So much that we just need three things to keep in mind:
</p>
<ul class="org-ul">
<li>Identify the data: know beforehand wich data we need and make sure it is available
<ul class="org-ul">
<li>Know the domain of the data (possible values it SHOULD take).</li>
</ul></li>
<li>Determine the results: keep in mind the goal of the program and which information we must obtain form it.</li>
<li>Keep the Operations explicit: find the operational relationships between data and the results to be obtained.</li>
</ul>
</div>

<div id="outline-container-org2c6b99c" class="outline-4">
<h4 id="org2c6b99c"><span class="section-number-4">1.1.1</span> Example</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Determine an employee&rsquo;s salary given it varies according to the hours worked during the month.
</p>

<ul class="org-ul">
<li>Data: Hours Worked (HW) and Hour Value (HV).</li>
<li>Result: Salary (SL)</li>
<li>Operational Relationship: SL = (HW * HV)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgaab4903" class="outline-3">
<h3 id="orgaab4903"><span class="section-number-3">1.2</span> But it&rsquo;s not THAT simple&#x2026;</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The calculation of the salary may seem trivial at first sight but when whe think about a data-first/solution-later approach we remember that we must know the domain of the data. How can we be completely sure that we know the values that the salary can take? A single error in this calculation can leave a family with no christmas presents or get an accounting employee fired. Some qestions we may ask are:
</p>
<ul class="org-ul">
<li>How many hours is a worker allowed to do max?</li>
<li>Is any contract part time? How many hours does it have?</li>
<li>What is the minimum and maximum values for the hourly pay?</li>
<li>What does the hourly pay depend on? Seniority? Years of service?</li>
<li>etc.</li>
</ul>
<p>
Most of the time you won&rsquo;t be the one who knows most of the answers so the logical decision to make is to ask them to somebody with <b>domain knowledge</b> on the subject.
</p>

<blockquote>
<p>
You cannot know the domain of data unless you have domain knowledge.
</p>
</blockquote>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Doe</p>
<p class="date">Created: 2020-06-11 Thu 04:17</p>
</div>
</body>
</html>
